app/Controllers/AuthController.php

    public function processLogin()
    {
        $validation = \Config\Services::validation();

        // Validasi input
        $validation->setRules([
            'username' => 'required',
            'password' => 'required'
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->back()->with('errors', $validation->getErrors());
        }

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $usersModel = new UsersModel();
        $user = $usersModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'adii'
 LIMIT 1