app/Controllers/Pengajuan.php

    public function detail($id)
    {
        $pengajuanModel = new PengajuanModel();
        $pengajuan = $pengajuanModel->find($id);
---
SELECT *
FROM `pengajuan`
WHERE `pengajuan`.`id` = '11'