app/Views/tanya_ft.php

<?php
$pengajuanModel = new \App\Models\PengajuanModel();
$pengajuanList = $pengajuanModel->findAll();
---
SELECT *
FROM `pengajuan`